; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	image2 - mode
	spectrograph0 - mode
	image3 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Star21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Planet24 - direction
	Star25 - direction
	Planet26 - direction
	Planet27 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon19)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star17)
	(supports instrument3 image3)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image3)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument6 infrared1)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Planet11)
	(pointing satellite4 Planet16)
	(have_image Planet4 image2)
	(have_image Planet5 image2)
	(have_image Planet7 image3)
	(have_image Star9 infrared1)
	(have_image Star10 image2)
	(have_image Planet11 image3)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 image2)
	(have_image Phenomenon14 image2)
	(have_image Planet15 spectrograph0)
	(have_image Planet16 spectrograph0)
	(have_image Planet18 infrared1)
	(have_image Phenomenon19 image3)
	(have_image Planet20 image3)
	(have_image Star21 image3)
	(have_image Phenomenon22 infrared1)
	(have_image Planet23 image2)
	(have_image Planet24 image2)
	(have_image Star25 spectrograph0)
	(have_image Planet26 image3)
	(have_image Planet27 spectrograph0)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 24
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 24
3. (calibrate satellite3 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 24
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 24
5. (turn_to satellite4 planet16 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet16)
   goals met: 1 of 24
6. (turn_to satellite3 phenomenon12 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 24
7. (take_image satellite3 phenomenon12 instrument5 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 2 of 24
8. (turn_to satellite3 phenomenon19 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon19)
   goals met: 2 of 24
9. (take_image satellite3 phenomenon19 instrument5 image3)
   added: (have_image phenomenon19 image3)
   goals met: 3 of 24
10. (turn_to satellite3 phenomenon22 phenomenon19)
   deleted: (pointing satellite3 phenomenon19)
   added: (pointing satellite3 phenomenon22)
   goals met: 3 of 24
11. (take_image satellite3 phenomenon22 instrument5 infrared1)
   added: (have_image phenomenon22 infrared1)
   goals met: 4 of 24
12. (turn_to satellite3 planet11 phenomenon22)
   deleted: (pointing satellite3 phenomenon22)
   added: (pointing satellite3 planet11)
   goals met: 4 of 24
13. (take_image satellite3 planet11 instrument5 image3)
   added: (have_image planet11 image3)
   goals met: 5 of 24
14. (turn_to satellite3 planet15 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet15)
   goals met: 5 of 24
15. (take_image satellite3 planet15 instrument5 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 6 of 24
16. (turn_to satellite3 planet16 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet16)
   goals met: 6 of 24
17. (take_image satellite3 planet16 instrument5 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 7 of 24
18. (turn_to satellite3 planet18 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet18)
   goals met: 7 of 24
19. (take_image satellite3 planet18 instrument5 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 8 of 24
20. (turn_to satellite3 planet20 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet20)
   goals met: 8 of 24
21. (take_image satellite3 planet20 instrument5 image3)
   added: (have_image planet20 image3)
   goals met: 9 of 24
22. (turn_to satellite3 planet26 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 planet26)
   goals met: 9 of 24
23. (take_image satellite3 planet26 instrument5 image3)
   added: (have_image planet26 image3)
   goals met: 10 of 24
24. (turn_to satellite3 planet27 planet26)
   deleted: (pointing satellite3 planet26)
   added: (pointing satellite3 planet27)
   goals met: 10 of 24
25. (take_image satellite3 planet27 instrument5 spectrograph0)
   added: (have_image planet27 spectrograph0)
   goals met: 11 of 24
26. (turn_to satellite3 planet7 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 planet7)
   goals met: 11 of 24
27. (take_image satellite3 planet7 instrument5 image3)
   added: (have_image planet7 image3)
   goals met: 12 of 24
28. (turn_to satellite3 star21 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star21)
   goals met: 12 of 24
29. (take_image satellite3 star21 instrument5 image3)
   added: (have_image star21 image3)
   goals met: 13 of 24
30. (turn_to satellite3 star25 star21)
   deleted: (pointing satellite3 star21)
   added: (pointing satellite3 star25)
   goals met: 13 of 24
31. (take_image satellite3 star25 instrument5 spectrograph0)
   added: (have_image star25 spectrograph0)
   goals met: 14 of 24
32. (turn_to satellite3 star9 star25)
   deleted: (pointing satellite3 star25)
   added: (pointing satellite3 star9)
   goals met: 14 of 24
33. (take_image satellite3 star9 instrument5 infrared1)
   added: (have_image star9 infrared1)
   goals met: 15 of 24
34. (turn_to satellite2 planet11 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 planet11)
   goals met: 16 of 24
35. (turn_to satellite1 star0 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 star0)
   goals met: 17 of 24
36. (turn_to satellite0 phenomenon14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon14)
   goals met: 17 of 24
37. (turn_to satellite0 star3 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star3)
   goals met: 17 of 24
38. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 17 of 24
39. (turn_to satellite0 phenomenon14 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon14)
   goals met: 17 of 24
40. (take_image satellite0 phenomenon14 instrument0 image2)
   added: (have_image phenomenon14 image2)
   goals met: 18 of 24
41. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 18 of 24
42. (take_image satellite0 planet13 instrument0 image2)
   added: (have_image planet13 image2)
   goals met: 19 of 24
43. (turn_to satellite0 planet23 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet23)
   goals met: 19 of 24
44. (take_image satellite0 planet23 instrument0 image2)
   added: (have_image planet23 image2)
   goals met: 20 of 24
45. (turn_to satellite0 planet24 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet24)
   goals met: 20 of 24
46. (take_image satellite0 planet24 instrument0 image2)
   added: (have_image planet24 image2)
   goals met: 21 of 24
47. (turn_to satellite0 planet4 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet4)
   goals met: 21 of 24
48. (take_image satellite0 planet4 instrument0 image2)
   added: (have_image planet4 image2)
   goals met: 22 of 24
49. (turn_to satellite0 planet5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet5)
   goals met: 22 of 24
50. (take_image satellite0 planet5 instrument0 image2)
   added: (have_image planet5 image2)
   goals met: 23 of 24
51. (turn_to satellite0 star10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star10)
   goals met: 23 of 24
52. (take_image satellite0 star10 instrument0 image2)
   added: (have_image star10 image2)
   goals met: 24 of 24
